app/controllers/api/programms_controller.rb

  def index
    #Define Params that can be used in the call
    date = params[:date] rescue nil
    time_from = params[:time_from] rescue nil
    time_to = params[:time_from] rescue nil
    channel = params[:channel] rescue nil
    show_type = params[:showtype] rescue nil

    #Build Date Conditions
    date_conditions = "programms.date = " + date.to_s if date rescue nil
    time_conditions = "programms.time between " + time_from + "and " + time_to if time_from && time_to

    #Build Channel Conditions
    if channel
      channel_find = Channel.where("name = ?", channel).to_ary
      if !channel_find.blank?
        channel_conditions = "channel_id = " + channel_find[0].id.to_s
      end
    end

    #Build Filter Condtions for Showtypes
    if show_type
      showtype_find = ShowType.where("name = ?", show_type).to_ary
      shows = Show.where("show_type_id = ?", showtype_find[0].id).to_ary
---
SELECT `channels`.* FROM `channels` WHERE (name = 'ZDF')
SELECT `show_types`.* FROM `show_types` WHERE (name = 'News')
SELECT `shows`.* FROM `shows` WHERE (show_type_id = 1)