app/controllers/api/programms_controller.rb

SELECT `programms`.* FROM `programms`
---
  def index
    @programms = Programm.all

SELECT  `programms`.* FROM `programms` WHERE `programms`.`id` = 0 LIMIT 1
---
    def set_programm
      @programm = Programm.find(params[:id])